# ==================================================
# 파일명: upload_log.py
# 역할: 업로드 완료 기록 저장
# ==================================================


# ==================================================
# 1. 라이브러리 import
# ==================================================

import json
import os


# ==================================================
# 2. 로그 파일 경로
# ==================================================

LOG_FILE = "data/uploaded_log.json"


# ==================================================
# 3. 로그 읽기
# ==================================================

def load_upload_log():

    if not os.path.exists(LOG_FILE):
        return {}

    with open(LOG_FILE, "r", encoding="utf-8")as file:
        return json.load(file)


# ==================================================
# 4. 업로드 여부 확인
# ==================================================

def is_uploaded(key):

    log = load_upload_log()
    
    return key in log


# ==================================================
# 5. 업로드 완료 저장
# ==================================================

def save_uploaded(key):

    log = load_upload_log()
    
    log[key] = True
    
    with open(LOG_FILE, "w", encoding="utf-8") as file:
        
        json.dump(log, file, ensure_ascii=False, indent=4)